{
  "name": "Om Rajendra Kathalkar",
  "contact": {
    "phone": "+91-9834020753",
    "email": "om.kathalkar@research.iiit.ac.in"
  },
  "education": [
    {
      "degree": "Master of Science in Electronics and Communication Engineering",
      "institution": "International Institute Information Technology(IIIT-H)",
      "location": "Hyderabad",
      "duration": "2023-Present"
    },
    {
      "degree": "Bachelor of Engineering in Electronics and Telecommunication Engineering",
      "institution": "St. Vincent Pallotti College of Engineering and Technology",
      "location": "Nagpur",
      "gpa": "8.83/10.0",
      "duration": "2019-2023"
    },
    {
      "degree": "Class XII, HSC",
      "institution": "Jr. College of New High School Main",
      "location": "Amravati",
      "percentage": "70%",
      "duration": "2017-2019"
    },
    {
      "degree": "Class X, SSC",
      "institution": "Shri Samarth High School",
      "location": "Amravati",
      "percentage": "90%",
      "duration": "2011-2017"
    }
  ],
  "skills": {
    "areas_of_interest": [
      "Internet of Things",
      "Machine Learning",
      "Computer Vision"
    ],
    "programming": [
      "Python",
      "C++",
      "Matlab",
      "HTML"
    ],
    "hardware": [
      "Jetson Xavier NX",
      "Raspberry Pi",
      "Arduino",
      "Esp-Series Micro-controllers"
    ],
    "tools": [
      "Pytorch",
      "Tensorflow",
      "OpenCV",
      "Cuda",
      "Django",
      "Scikit-learn",
      "LaTeX"
    ]
  },
  "publications": [
    {
      "title": "CV and IoT-based Remote Triggered Labs: Use Case of Conservation of Mechanical Energy",
      "conference": "FiCloud 2022, Rome, Italy",
      "authors": [
        "K.S. Viswanadh",
        "Om Kathalkar",
        "Sachin Chaudhari"
      ],
      "description": "This paper discusses the use of Computer Vision (CV) in Remote Labs (RTL), which are useful for virtual laboratory experiments. The Conservation of Mechanical Energy experiment is used as a case study, where a CV-based approach is used to estimate an object's velocity. The CV-based implementation is found to be more accurate, with a mean-squared error (MSE) nearly 10 times better than the IR-based implementation, and can be helpful for distance learning and during pandemics."
    },
    {
      "title": "Protocol for Hunting PM2.5 Emission Hot Spots in Cities",
      "conference": "1st International Workshop on Advances in Environmental Sensing Systems for Smart Cities (EnvSys '23), Helsinki, Finland",
      "authors": [
        "Spanddhana Sara",
        "Andrew Rebeiro-Hargrave",
        "Om Kathalkar",
        "Sachin Chaudhari"
      ],
      "description": "This paper discusses the development of a mobile-based protocol utilizing search agents to locate PM2.5 emission hot spots in cities, enhancing knowledge of air pollution's health effects. Leveraged IoT devices and image processing to analyze variations in pollution levels, identifying industrial areas and busy roads as prominent sources."
    },
    {
      "title": "TRAQID - Traffic-Related Air Quality Image Dataset",
      "conference": "The 35th British Machine Vision Conference, Glasgow, UK",
      "authors": [
        "Om Kathalkar",
        "Sachin Chaudhari"
      ],
      "description": "This paper discusses the limitations of sensor-based methods in air quality estimation and introduces TRAQID - a novel image dataset for traffic-related air quality analysis. With over 27,000 multi-view images captured in Hyderabad, India, TRAQID addresses the scarcity of diverse datasets in this field. It offers insights into various environmental factors affecting air quality, aiding the development of more accurate estimation techniques."
    }
  ],
  "patents": [
    {
      "title": "SYSTEM AND METHOD FOR IMPLEMENTING AN EXPERIMENT REMOTELY AND DETERMINING AN OUTPUT USING A COMPUTER VISION MODEL",
      "number": "US20240078641A1",
      "type": "Published US Provisional Patent",
      "date": "March 2024"
    },
    {
      "title": "SYSTEM AND METHOD FOR GENERATING TRAFFIC-RELATED AIR QUALITY IMAGE DATASETS",
      "number": "202441043706",
      "type": "Provisional Patent",
      "date": "May 2024" 
    },
    {
      "title": "SYSTEM AND METHOD FOR GENERATING MULTI-MODAL SENSOR DATASET FOR TRAFFIC RELATED POLLUTION",
      "number": "MY269127S",
      "type": "Provisional Patent",
      "date": "May 2024"
    }
  ],
  "work_experience": [
    {
      "title": "Research Assistant",
      "company": "Signal Processing and Communications Research Centre, IIIT-H",
      "duration": "Aug 2021 - Present",
      "description": "Pursuing research under Prof. Sachin Chaudhari on the application of Machine Learning and Computer Vision towards smarter Internet of Things. Working on development of an Air Quality Monitoring System in Hyderabad. The work involves deploying IoT-based devices for real-time estimation of Air Quality Index (AQI) in the city. Our aim is to enhance the accuracy and timeliness of air quality data collection and analysis, enabling better monitoring and understanding of the air pollution levels in Hyderabad."
    },
    {
      "title": "Summer Intern",
      "company": "e-Yantra Labs, IIT-Bombay",
      "duration": "May 2020 - August 2021",
      "description": "Worked with Prof. Rohan Vaidya on IoT-based real-life problem statements like Warning System for Vehicles to Avoid Drowning in Waterlogged Roads and solutions and completed projects on Robot Operating System (ROS)."
    },
    {
      "title": "Part-Time Intern",
      "company": "Dysmech Consultancy Services, Pune",
      "duration": "June 2020 - September 2020",
      "description": "Led and Worked with DCS team on the deployment of Smart Water Management in a household society in Pune."
    }
  ],
  "teaching_experience": [
    {
      "title": "AI-ML Mentor",
      "company": "NSE TalentSprint, Hyderabad",
      "duration": "May 2024 - Present",
      "description": "Providing mentorship to industry professionals enrolled in the AIML certification course, in collaboration with TalentSprint, an education company by National Stock Exchange. My responsibilities included guiding participants through topics such as Machine Learning, Deep Learning, and Data Science via hands-on notebooks. Additionally, I mentored teams in their capstone projects, assisting with scoping, planning, implementation, bug fixing, deployment, and final presentations."
    },
    {
      "title": "Teaching Assistant",
      "company": "IIIT, Hyderabad",
      "duration": "Monsoon 2023",
      "description": "Worked with Dr. Sachin Chaudhari and Dr. Nagamanikandan Govindan to conduct lab sessions on Internet of Things (IoT) for IIIT M.Tech students. These sessions involved guiding students in interfacing sensors and implementing real-world projects as part of their course curriculum."
    },
    {
      "title": "Teaching Assistant",
      "company": "KEIT, Hyderabad",
      "duration": "Jan 2023 - Aug 2023",
      "description": "Taught B.Tech 4th year students at Kakinada Institute of Engineering and Technology, Hyderabad, various concepts of the Internet of Things (IoT). During the sessions, I focused on IoT protocols and conducted hands-on online sessions to accommodate students from non-IoT backgrounds. This experience provided me with valuable insights into effective teaching methods for diverse student populations."
    }
  ],
  "research_projects": [
    {
      "title": "Remote Triggered Labs for the Conservation of Energy Setup",
      "organization": "Remote Labs, IIIT-Hyderabad",
      "duration": "March 2022",
      "description": "Developed Remote Triggered Lab, which enables students to remotely access hardware setups and experiment with them by tuning various parameters and observing their live outputs. For this, a use-case of the Conservation of Mechanical Energy experiment is considered. A CV-based approach is used to estimate an object's velocity whose setup primarily consists of a microprocessor, a camera and infrared (IR) sensors. The experiment is recorded, and various CV techniques are employed to estimate the object's velocity."
    },
    {
      "title": "The Application of the Mobile Platform to Hunt for PM2.5 Emission Hotspots in Cities",
      "organization": "SPCRC, IIIT-Hyderabad",
      "duration": "May 2023",
      "description": "Developed a low-cost mobile platform protocol for identifying harmful PM2.5 emission hot spots in cities, addressing the impact on human health. Used portable IoT devices on a mobile platform to detect pollutant levels within short distances. Applied the protocol in Hyderabad, India using a street car."
    },
    {
      "title": "IoT-based AQI Estimation using Image Processing and Learning Methods",
      "organization": "SPCRC, IIIT-Hyderabad",
      "duration": "Aug 2022 - Present",
      "description": "Employing an innovative image-based approach to estimate the Air Quality Index (AQI), surpassing the limitations of traditional air pollution monitoring systems, known for their cumbersome nature, high expenses, power consumption, and maintenance requirements, to ensure more efficient and effective results."
    }
  ],
  "academic_projects": [
    {
      "title": "Warning System for Vehicles to Avoid Drowning in Waterlogged Roads",
      "organization": "e-Yantra, IIT-Bombay",
      "description": "Developed innovative solution using sensor technology to accurately measure water levels and provide timely alerts to municipal and traffic departments, mitigating the risk of flooding-related accidents and improving road safety."
    },
    {
      "title": "Smart Water Management System Using IoT",
      "organization": "Dysmech Consultancy Services, Pune",
      "description": "Created and Implemented a Smart and Robust Water management system for local residency in Pune, Maharashtra."
    }
  ],
  "achievements": [
    {
      "title": "Winner at the International Environmental Sensing Project Competition held by the University of Helsinki, Finland",
      "date": "December 2022"
    },
    {
      "title": "Best Demo Award at IIIT-H's R&D Showcase 2022"
    },
    {
      "title": "AIR-1 Gold Award at the e-Yantra Ideas Competition held by IIT Bombay"
    },
    {
      "title": "Best Student of the Year of the batch 2023 at SVPCET, Nagpur"
    },
    {
      "title": "Best Project Award for the undergraduate final year project"
    },
    {
      "title": "Best Student of the Department of ETC Department, SVPCET, Nagpur"
    },
    {
      "title": "Appreciation for securing 1st rank in the 4th semester of B.E. at the University level with 9.89 SGPA"
    },
    {
      "title": "Gold Medal in National Science Olympiad",
      "date": "Aug'16"
    }
  ],
  "extracurricular_activities": [
    {
      "title": "Player at Intercollegiate Cricket Team at IIIT, Hyderabad"
    },
    {
      "title": "Core Team Member of National Service Scheme(NSS) Team at SVPCET, Nagpur"
    },
    {
      "title": "Campus Coordinator of Internshala Student Partner at College Campus"
    },
    {
      "title": "Player at Intercollegiate Cricket Team at SVPCET, Nagpur"
    },
    {
      "title": "Volunteer at Unnant Bharat Abhiyan, an organization for educating underprivileged students"
    },
    {
      "title": "Mentor for the High School Students for Electronics Workshop"
    }
  ],
  "languages": [
    {
      "name": "English",
      "proficiency": "Full Professional Proficiency"
    },
    {
      "name": "Hindi",
      "proficiency": "Professional Working Proficiency"
    },
    {
      "name": "Marathi",
      "proficiency": "Native Proficiency"
    }
  ]
}
